cf/Documents/ПеремещениеТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ПеремещениеТМЦ</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТМЦ</xr:Item>
				<xr:Item>Document.РеализацияТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ПеремещениеТМЦ/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Свернем все товары чтобы избежать задвоенных строк
	ТЗТоваров = Товары.Выгрузить(,"Партия,Номенклатура,Количество");
	ТЗТоваров.Свернуть("Партия,Номенклатура","Количество");   

	
	// регистр ПартииТоваров Расход  и Приход
	Движения.ПартииТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из ТЗТоваров Цикл
		
		//Список Партий с остатками в Таблицу значений
		СписокОстатковПартий = Справочники.Партии.ПолучитьСписокОстатковПартий(ТекСтрокаТовары.Номенклатура,Дата,Склад,Организация,ТекСтрокаТовары.Партия); 
		НеобходимыйОстаток   = ТекСтрокаТовары.Количество;
		
		Для Каждого СтрокаПартии из СписокОстатковПартий Цикл
			
			Если НеобходимыйОстаток = 0 Тогда
				Прервать;  //Товар распределился по партиям
			КонецЕсли;
			
			ДвижениеРасход = Движения.ПартииТоваров.Добавить();
			ДвижениеРасход.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			ДвижениеРасход.Период 		= Дата;
			ДвижениеРасход.Организация 	= Организация;
			ДвижениеРасход.Склад 		= Склад;
			ДвижениеРасход.Номенклатура = ТекСтрокаТовары.Номенклатура;
			ДвижениеРасход.Партия 		= СтрокаПартии.Партия;
			
			Если НеобходимыйОстаток <= СтрокаПартии.КоличествоОстаток Тогда //ИЛИ СтрокаПартии.КоличествоОстаток < 0
				ДвижениеРасход.Количество 	= НеобходимыйОстаток;
				НеобходимыйОстаток 			= НеобходимыйОстаток - ДвижениеРасход.Количество;
				                                    				
			ИначеЕсли НеобходимыйОстаток > СтрокаПартии.КоличествоОстаток Тогда
				ДвижениеРасход.Количество 	= СтрокаПартии.КоличествоОстаток;
				НеобходимыйОстаток 			= НеобходимыйОстаток - ДвижениеРасход.Количество;
			КонецЕсли;
            ДвижениеРасход.Сумма		= СтрокаПартии.Партия.ЗакупочнаяЦена * ДвижениеРасход.Количество;
			
			ДвижениеПриход = Движения.ПартииТоваров.Добавить();
			ДвижениеПриход.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			ДвижениеПриход.Период 		= Дата;
			ДвижениеПриход.Организация 	= Организация;
			ДвижениеПриход.Склад 		= СкладПолучатель;
			ДвижениеПриход.Номенклатура = ТекСтрокаТовары.Номенклатура;
			ДвижениеПриход.Партия 		= ДвижениеРасход.Партия;
			ДвижениеПриход.Количество 	= ДвижениеРасход.Количество;
			ДвижениеПриход.Сумма		= СтрокаПартии.Партия.ЗакупочнаяЦена * ДвижениеПриход.Количество;

		КонецЦикла;
		
		//Если нехватило остатков, то берем из последней партии
		Если НеобходимыйОстаток > 0 Тогда
			
			Если Организация.КонтролироватьОстатки Тогда
				Сообщить("" +Ссылка +Символы.ПС+
				"Нехватает: " +НеобходимыйОстаток+ " " +ТекСтрокаТовары.Номенклатура+ ", Склад: " +Склад+ ", Организация: " +Организация);
				Отказ = Истина;
			Иначе 				
				ДвижениеРасход.Количество 	= ДвижениеРасход.Количество + НеобходимыйОстаток;
				ДвижениеРасход.Сумма		= СтрокаПартии.Партия.ЗакупочнаяЦена * ДвижениеРасход.Количество;
				ДвижениеПриход.Количество 	= ДвижениеПриход.Количество + НеобходимыйОстаток;
				ДвижениеПриход.Сумма		= СтрокаПартии.Партия.ЗакупочнаяЦена * ДвижениеПриход.Количество;
			КонецЕсли;
			
		КонецЕсли; 		
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТМЦ") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Партия 			= ТекСтрокаТовары.Партия;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТМЦ") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Партия 			= ТекСтрокаТовары.Партия;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
